# Справка по использованию
Добро пожаловать в документацию по проекту **Система компьютерной алгебры на длинных числах!**

В нашем проекте мы стремимся создать мощный инструмент для работы с длинными числами, который будет полезен как для исследователей, так и для разработчиков. Система предоставляет возможность выполнять сложные математические операции с числами, превышающими стандартные размеры, что открывает новые горизонты в области вычислений.

### Основные особенности:
- **Поддержка длинных чисел**: Мы реализуем алгоритмы для работы с числами произвольной длины, что позволяет обрабатывать данные, выходящие за пределы стандартных типов.
- **Гибкость использования**: Система может быть использована как через командную строку (CLI), так и в качестве библиотеки для интеграции в другие приложения.
- **Расширяемость**: Архитектура проекта позволяет легко добавлять новые функции и улучшения, что делает его идеальным для дальнейших исследований и разработок.

Мы надеемся, что данная документация поможет вам быстро освоить его возможности и начать продуктивную работу!
## Разделы
#### 1. [Синтаксис](#синтаксис)
#### 2. [Натуральные числа](#натуральные-числа)
#### 3. [Целые числа](#целые-числа)
#### 4. [Рациональные числа](#рациональные-числа)
#### 5. [Многочлены](#многочлены)
#### 6. [Инструкции для запуска](#инструкции-для-запуска)

## Синтаксис
**Типы данных задаются следующим образом:**
- Натуральные: `а = 5`
- Целые: `а = -5`
- Рациональные: `Frac[2, 3]` данная запись эквивалентна дроби `2/3`
- Многочлены: `Poly[[1, 1000], [-2, 1], [1, 0]]` данная запись эквивалентна `x^1000 - 2x + 1`

## Доступные модули

### Натуральные числа

#### COM_NN_D (a, b)
**Аргументы:**
- `a` и `b` — натуральные числа

**Возвращаемое значение:**
- 2 — если `a > b`;
- 0 — если аргументы равны;
- 1 — в противном случае.

**Пример использования:**
```
algebra> a = 3
algebra> COM_NN_D(a, 1)
>>>>>>>> 2
```


#### NZER_N_B (a)

**Аргумент:**
- `a` — натуральное число

**Возвращаемое значение:**
- `да` — если число не равно нулю;
- `нет` — в противном случае.

**Пример использования:**
```
algebra> a = 3
algebra> NZER_N_B(a)
>>>>>>>> да
```
> [!WARNING]
> Данный модуль нельзя использовать как участник операции или как аргумент функции.

#### ADD_1N_N (a)

**Аргумент:**
- `a` — натуральное число

**Возвращаемое значение:**
- Возвращает значение `a + 1`.

**Пример использования:**
```
algebra> a = 3
algebra> ADD_1N_N(a)
>>>>>>>> 4
```

#### ADD_NN_N (a, b)

**Аргумент:**
- `a` и `b` — натуральное число

**Возвращаемое значение:**
- Возвращает сумму двух натуральных чисел `a + b`

**Пример использования:**
```
algebra> a = 3
algebra> b = 4
algebra> ADD_NN_N(a, b)
>>>>>>>> 7
```

#### SUB_NN_N (a, b)

**Аргумент:**
- `a` и `b` — натуральное число

**Возвращаемое значение:**
- Возвращает результат вычитания `a - b`.

**Пример использования:**
```
algebra> a = 8
algebra> b = 4
algebra> SUB_NN_N(a, b)
>>>>>>>> 4
```

#### MUL_ND_N (a, d)

**Аргумент:**
- `a` — натуральное число
- `d` — целое число

**Возвращаемое значение:**
- Возвращает результат умножения `a * d`.

**Пример использования:**
```
algebra> a = 5
algebra> d = 2
algebra> MUL_ND_N(a, d)
>>>>>>>> 10
```

#### MUL_Nk_N (a, k)

**Аргумент:**
- `a` и `k`— натуральные числа

**Возвращаемое значение:**
- Возвращает результат умножения `a * 10^k`.

**Пример использования:**
```
algebra> a = 5
algebra> k = 2
algebra> MUL_Nk_N(a, k)
>>>>>>>> 500
```

#### MUL_NN_N (a, b)

**Аргумент:**
- `a` и `b`— натуральные числа

**Возвращаемое значение:**
- Возвращает результат умножения  `a * b`.

**Пример использования:**
```
algebra> a = 5
algebra> b = 2
algebra> MUL_NN_N(a, b)
>>>>>>>> 10
```

#### SUB_NDN_N (a, d)

**Аргумент:**
- `a` и `d`— натуральные числа

**Возвращаемое значение:**
- Возвращает результат вычитания `a - b * d`, если оно положительно.

**Пример использования:**
```
algebra> a = 8
algebra> b = 3
algebra> d = 2
algebra> SUB_NDN_N(a, d)
>>>>>>>> 2
```

#### DIV_NN_Dk (a, k)

**Аргумент:**
- `a` и `к`— натуральные числа

**Возвращаемое значение:**
- Возвращает первую цифру результата деления `(a / (b * 10^k))`.

**Пример использования:**
```
algebra> a = 300
algebra> b = 2
algebra> k = 1
algebra> DIV_NN_Dk(a, k)
>>>>>>>> 1
```

#### DIV_NN_N (a, b)

**Аргумент:**
- `a`— натуральное число
- `b`— натуральное число, отличное от 0

**Возвращаемое значение:**
- Возвращает неполное частное от деления `a / b`, с округлением вннз.

**Пример использования:**
```
algebra> a = 300
algebra> b = 2
algebra> DIV_NN_N(a, b)
>>>>>>>> 150
```

#### MOD_NN_N (a, b)

**Аргумент:**
- `a`— натуральное число
- `b`— натуральное число, отличное от 0

**Возвращаемое значение:**
- Возвращает неполное частное от деления `a % b`, с округлением вниз.

**Пример использования:**
```
algebra> a = 301
algebra> b = 2
algebra> MOD_NN_N(a, b)
>>>>>>>> 1
```

#### GCF_NN_N (a, b)

**Аргумент:**
- `a` и `b`— натуральные числа

**Возвращаемое значение:**
- Возвращает наибольший общий делитель (НОД) чисел `a` и `b`.

**Пример использования:**
```
algebra> a = 99
algebra> b = 36
algebra> GCF_NN_N(a, b)
>>>>>>>> 9
```
#### LCM_NN_N (a, b)

**Аргумент:**
- `a` и `b`— натуральные числа

**Возвращаемое значение:**
- Возвращает наименьшее общее кратное (НОК) чисел `a` и `b`.

**Пример использования:**
```
algebra> a = 99
algebra> b = 36
algebra> LCM_NN_N(a, b)
>>>>>>>> 396
```
### Целые числа

#### ABS_Z_N (a)
**Аргумент:**
- `a` — целое число

**Возвращаемое значение:**
- Возвращает абсолютную величину целого числа,как натуральное число.

**Пример использования:**
```
algebra> a=-5
algebra> ABS_Z_N(a)
>>>>>>>> 5
```

#### SGN_Z_D (a)

**Аргумент:**
- `a` — целое число

**Возвращаемое значение:**
- `2` — если `a` положительное; 
- `1` — если `a` отрицательное;
- `0` — если `a` равно нулю.
  

**Пример использования:**
```
algebra> a = 4
algebra> SGN_Z_D(a)
>>>>>>>> 2
```

#### MUL_ZM_Z (a)

**Аргумент:**
- `a` — целое число

**Возвращаемое значение:**
- Возвращает результат умножения `a` на `-1`.

**Пример использования:**
```
algebra> a = 4
algebra> MUL_ZM_Z(a)
>>>>>>>> -4
```

#### TRANS_N_Z (a)

**Аргумент:**
- `a` — натуральное число

**Возвращаемое значение:**
- Возвращает целое число, эквивалентное натуральному числу `a`.

**Пример использования:**
```
algebra> a = 4
algebra> TRANS_N_Z(a)
>>>>>>>> 4
```
#### TRANS_Z_N (a)

**Аргумент:**
- `a` — неотрицательное целое число

**Возвращаемое значение:**
- Возвращает натуральное число, эквивалентное неотрицательному целому числу `a`.

**Пример использования:**
```
algebra> a = 4
algebra> TRANS_Z_N(a)
>>>>>>>> 4
```

#### ADD_ZZ_Z (a, b)

**Аргумент:**
- `a`и`b` — целые числа

**Возвращаемое значение:**
- Возвращает сумму двух целых чисел `a + b`.

**Пример использования:**
```
algebra> a = 4
algebra> a = 5
algebra> ADD_ZZ_Z(a, b)
>>>>>>>> 9
```

#### SUB_ZZ_Z (a, b)

**Аргумент:**
- `a`и`b` — целые числа

**Возвращаемое значение:**
- Возвращает разницу двух целых чисел `a - b`.

**Пример использования:**
```
algebra> a = 4
algebra> a = 5
algebra> SUB_ZZ_Z(a, b)
>>>>>>>> -1
```
#### MUL_ZZ_Z (a, b)

**Аргумент:**
- `a`и`b` — целые числа

**Возвращаемое значение:**
- Возвращает произведение двух целых чисел `a * b`.

**Пример использования:**
```
algebra> a = 4
algebra> a = 5
algebra> MUL_ZZ_Z(a, b)
>>>>>>>> 20
```
#### DIV_ZZ_Z (a, b)

**Аргумент:**
- `a`— целое число
- `b` — целое число, отличное от `0`

**Возвращаемое значение:**
- Возвращает частное от деления двух целых чисел `a \ b`.

**Пример использования:**
```
algebra> a = 5
algebra> a = 4
algebra> DIV_ZZ_Z(a, b)
>>>>>>>> 1
```

#### MOD_ZZ_Z (a, b)

**Аргумент:**
- `a`— целое число
- `b` — целое число, отличное от `0`

**Возвращаемое значение:**
- Возвращает остаток от деления двух целых чисел `a % b`.

**Пример использования:**
```
algebra> a = 11
algebra> a = 4
algebra> MOD_ZZ_Z(a, b)
>>>>>>>> 3
```

### Рациональные числа

#### RED_Q_Q (a)

**Аргумент:**
- `a` — рациональное число

**Возвращаемое значение:**
- Возвращает сокращенную дробь в виде пары числитель и знаменатель.

**Пример использования:**
```
algebra> a = Frac[9, 6]
algebra> RED_Q_Q(a)
>>>>>>>> Frac[3, 2]
```

#### INT_Q_B (a)
**Аргумент:**
- `a` — рациональное число

**Возвращаемое значение:**
- `да` — если дробь является целым числом.
- `нет` — в противном случае.

**Пример использования:**
```
algebra> a = Frac[9, 3]
algebra> INT_Q_B(a)
>>>>>>>> да
```

#### TRANS_Z_Q (a)
**Аргумент:**
- `a` — целое число

**Возвращаемое значение:**
- Возвращает целое число, записанное в виде неправильной дроби.

**Пример использования:**
```
algebra> a = 5
algebra> TRANS_Z_Q(a)
>>>>>>>> Frac[5, 1]
```
#### TRANS_Q_Z (а)
**Аргумент:**
- `a` — рациональное число, в знаменателе которого `1`

**Возвращаемое значение:**
- Возвращает целое число,эквивалентное числителю дроби.

**Пример использования:**
```
algebra> a = Frac[5, 1]
algebra> TRANS_Q_Z(а)
>>>>>>>> 5
```

#### ADD_QQ_Q (a, b)
**Аргумент:**
- `a` и `b` — рациональные числа

**Возвращаемое значение:**
- Возвращает сокращённый результат сложения двух дробей в виде пары (числитель, знаменатель).

**Пример использования:**
```
algebra> a = Frac[1, 3]
algebra> b = Frac[1, 2]
algebra> INT_Q_B(a, b)
>>>>>>>> Frac[1, 6]
```

#### SUB_QQ_Q (a, b)
**Аргумент:**
- `a` и `b` — рациональные числа

**Возвращаемое значение:**
- Возвращает сокращённый результат вычитания двух дробей в виде пары (числитель, знаменатель).

**Пример использования:**
```
algebra> a = Frac[1, 3]
algebra> b = Frac[1, 2]
algebra> SUB_QQ_Q (a, b)
>>>>>>>> Frac[1, 6]
```

#### MUL_QQ_Q (a, b)
**Аргумент:**
- `a` и `b` — рациональные числа

**Возвращаемое значение:**
- Возвращает сокращённый результат произведения двух дробей в виде пары (числитель, знаменатель).

**Пример использования:**
```
algebra> a = Frac[1, 3]
algebra> b = Frac[1, 2]
algebra> MUL_QQ_Q (a, b)
>>>>>>>> Frac[1, 6]
```

#### DIV_QQ_Q (a, b)
**Аргумент:**
- `a` — рациональное число
- `b` — рациональное число, отличное от нуля

**Возвращаемое значение:**
- Возвращает сокращённый результат деления двух дробей в виде пары (числитель, знаменатель).

**Пример использования:**
```
algebra> a = Frac[1, 3]
algebra> b = Frac[1, 2]
algebra> DIV_QQ_Q(a, b)
>>>>>>>> Frac[2, 3]
```

### Многочлены

#### ADD_PP_P (a, b)
**Аргумент:**
- `a` и `b` — многочлены

**Возвращаемое значение:**
- Возвращает результат суммы двух многочленов `a + b`.

**Пример использования:**
```
algebra> a = Poly[[-7, 2], [2, 1], [3, 0]]
algebra> b = Poly[[-4, 2], [-2, 1], [3, 0]]
algebra> ADD_PP_P (a, b)
>>>>>>>> Poly[[-11, 2], [6, 0]]
```

#### SUB_PP_P (a, b)
**Аргумент:**
- `a` и `b` — многочлены

**Возвращаемое значение:**
- Возвращает результат разности двух многочленов 'a - b'.

**Пример использования:**
```
algebra> a = Poly[[-6, 2], [-5, 1], [7, 0]]
algebra> b = Poly[[-6, 2], [-4, 1], [-8, 0]]
algebra> SUB_PP_P(а, b)
>>>>>>>> Poly[[-1, 1], [15, 0]]
```

#### MUL_PQ_P (a, d)
**Аргумент:**
- `a` — многочлен
- `d` — рациональное число

**Возвращаемое значение:**
- Возвращает результат произведения многочлена на скаляр 'a * d'.

**Пример использования:**
```
algebra> a = Poly[[-6, 2], [-5,1 ], [7, 0]]
algebra> d = 3
algebra> MUL_PQ_P (a, d)
>>>>>>>> Poly[[-18, 2], [-51, 1], [21, 0]]
```
#### LED_P_Q (a)
**Аргумент:**
- `a` — многочлен

**Возвращаемое значение:**
- Возвращает старший коэффициент многочлена.

**Пример использования:**
```
algebra> a = Poly[[-6, 2], [-5, 1], [7, 0]]
algebra> LED_P_Q(a)
>>>>>>>> Frac[-6, 1]
```

#### DEG_P_N (a)
**Аргумент:**
- `a` — многочлен

**Возвращаемое значение:**
- Возвращает степень многочлена.

**Пример использования:**
```
algebra> a = Poly[[-6, 2], [-5, 1], [7, 0]]
algebra> DEG_P_N(a)
>>>>>>>> 2
```

#### FAC_P_Q (a)
**Аргумент:**
- `a` — многочлен

**Возвращаемое значение:**
- Возвращает НОК знаменателей коэффициентов и НОД числителей многочлена.

**Пример использования:**
```
algebra> a = Poly[[Frac[2, 3], 2], [Frac[4, 5], 1]]
algebra> FAC_P_Q(a)
>>>>>>>> Frac[2, 15]
```

#### MUL_PP_P (a,b)
**Аргумент:**
- `a` и `b` — многочлены

**Возвращаемое значение:**
- Возвращает произведение многочленов `a + b`.

**Пример использования:**
```
algebra> a = Poly[[-6, 2], [-5, 1], [7, 0]]
algebra> b = Poly[[-6, 2], [-4, 1], [-8, 0]]
algebra> MUL_PP_P(a,b)
>>>>>>>> Poly[[36, 4], [54, 3], [26, 2], [12, 1], [-56, 0]]
```

#### DIV_PP_P (a,b)
**Аргумент:**
- `a` и `b` — многочлены

**Возвращаемое значение:**
- Возвращает частное от деления многочленов с остатком `a \ b`.

**Пример использования:**
```
algebra> a = Poly[[10, 5], [3, 4], [-12, 3], [25, 2], [-2, 1], [5, 0]]
algebra> b = Poly[[5, 2], [-1, 1], [2, 0]]
algebra> DIV_PP_P(a,b)
>>>>>>>> Poly[[2, 3], [1, 2], [-3, 1], [4, 0]]
```

#### MOD_PP_P (a,b)
**Аргумент:**
- `a` и `b` — многочлены

**Возвращаемое значение:**
- Возвращает остаток от деления многочленов `a % b`.

**Пример использования:**
```
algebra> a = Poly[[10, 5], [3, 4], [-12, 3], [25, 2], [-2, 1], [5, 0]]
algebra> b = Poly[[5, 2], [-1, 1], [2, 0]]
algebra> MOD_PP_P(a,b)
>>>>>>>> Poly[[8, 1], [-3, 0]]
```
#### GCF_PP_P (a,b)
**Аргумент:**
- `a` и `b` — многочлены

**Возвращаемое значение:**
- Возвращает НОД многочленов `a` и `b`.

**Пример использования:**
```
algebra> a = Poly[[2, 3], [-4, 2], [-8, 0]]
algebra> b = Poly[[1, 2], [-2, 0]]
algebra> GCF_PP_P (a,b)
>>>>>>>> Poly[[6, 1], [-8, 0]]
```

#### DER_P_P (a)
**Аргумент:**
- `a` — многочлен

**Возвращаемое значение:**
- Возвращает производную от многочлена `a`.

**Пример использования:**
```
algebra> a = Poly[[2, 3], [-4, 2], [-8, 0]]
algebra> DER_P_P (a)
>>>>>>>> Poly[[6, 2], [-8, 1], [6, 0]]
```

#### NMR_P_P (a)
**Аргумент:**
- `a` — многочлен

**Возвращаемое значение:**
- Возвращает многочлен 'a' с замененными кратными корнями на простые.

**Пример использования:**
```
algebra> a = Poly[[1, 2], [-2, 1], [1, 0]] 
algebra> NMR_P_P (a)
>>>>>>>> Poly[[1, 1], [-1, 0]] 
```

### Инструкции для запуска
Нашу программу можно как скачать по данной ссылке:`https://github.com/postusername/dm-2024-3388/releases` , так и сбилдить самому, используя следующие инструкции

**Для запуска на Windows**
- Для самой программы:
```
choco install make
git clone https://github.com/postusername/dm-2024-3388.git
cd dm-2024-3388
./configure
make algebra
cd build
algebra.exe
```
- Для запуска тестов в той же директории:
```
make tests
cd build
./tests.exe
```

**Для запуска на Linux**
- Для самой программы:
```
sudo apt-get install g++ make
git clone https://github.com/postusername/dm-2024-3388.git
cd dm-2024-3388
./configure
make algebra
cd build
./algebra
```
- Для запуска тестов в той же директории:
```
make tests
cd build
./tests
```

**Для запуска на MacOS**
- Для самой программы:
```
brew install gcc make
git clone https://github.com/postusername/dm-2024-3388.git
cd dm-2024-3388
./configure
make algebra
cd build
./algebra

```
- Для запуска тестов в той же директории:
```
make tests
cd build
./tests
```


